{
    "name": "Soulbinding",
    "icon": "randomthings:spectreanchor",
    "category": "patchouli:bloodaddendum",
    "advancement": "patchouli:bloodaddendum/puresoul",
    "pages": [
        {
            "type": "text",
            "text": "One of my test subjects happens to be a locksmith, and he is proving to be very useful, so I kept him alive for a while. It seems this decision has payed off more than I could have ever hoped. I gave him a set of materials: sanguinite, tartarite, void metal, and shadow steel. I then asked him to forge a lock that was unable to be forced open or picked, neither by magic nor mundane means."
        },
        {
            "type": "text",
            "text": "He was unsuccessful in this, but what he came up with was far beyond anything I could have expected. He had fashioned these materials in such a way that they resonated when near my blade, and other things constructed from soulium. I began researching this property, and it wasn't long until I had a breakthrough.$(br)I had infused the lock with the soul of the blacksmith, which seemed to make it rather sticky, adhering to anything living."
        },
        {
            "type": "text",
            "text": "This was a while ago at this point, and I had hit a dead end, so I neglected to write down any of this information. But now, with the power of purified souls, I decided to go back through my research in search of possible improvements to make. My search led me to the lock, which I had left in a drawer. Using an obscene amount of demon will, the purified soul forced the blacksmith's soul out of the lock, and bound itself to it in its place."
        },
        {
            "type": "spotlight",
            "item": "randomthings:spectreanchor",
            "text": "This new lock seems to bind itself to the soul, rather than the body. It also seems to absorb any item crafted with it, permanently taking on its shape and all of its properties, while keeping the 'soulbinding' behavior it has normally.$(br)I should note that the lock will not transform into anything 'stackable'."
        }
    ]
}