{
    "name": "Soulium Block",
    "icon": "contenttweaker:soul_block",
    "category": "patchouli:bloodaddendum",
    "advancement": "patchouli:bloodaddendum/soulium",
    "pages": [
        {
            "type": "text",
            "text": "A cubic meter of soulium might be a little bit expensive, but its properties are rather interesting. It appears to interact with vis in very subtle ways that I cannot quite describe. Additionally, it can be 'destabilized' by simply soaking it in a blood altar, transforming instantly on contact."
        },
        {
            "type": "spotlight",
            "item": "randomthings:diaphanousblock{meta: 0, display: {Name: 'Destabilized Soulium'}, block: 'contenttweaker:soul_block', inverted: 0}",
            "text": "This destabilized form seems useful for decoration, but not much else. It is intangible when placed, and visible only from a distance. It can have its appearance changed by crafting it with any simple block, or have its behavior inverted when put into a grid by itself."
        },
        {
            "type": "text",
            "text": "As for the normal form, it appears incomplete. It is barely more dense than air, and I believe that if I can manage to increase this density it may prove more useful. However, the block refused to be compressed down by any method that I could think of. I tried simply using my hands, using a vice, pistons, I even dropped an anvil on it, but nothing has worked thus far.$(br)Brute force does not seem to be the solution."
        },
        {
            "type": "text",
            "text": "I do have a different lead though: its interaction with the local aura intrigues me, and might be the solution I am looking for. I tried infusing various types of essentia into it, but these always ended in very unpredictable results, ranging from giving me a migraine to $(k)when$() $(k)the$() $(k)imposter$() $(k)is$() $(k)sus$().$(br)I need some time to think on it, and I feel like thaumaturgy is the right path.$(br)$(4)Perhaps I could find some way to transform the block?"
        }
    ]
}