{
    "name": "The Deepest Dark",
    "icon": "beneath:teleporterbeneath",
    "category": "patchouli:dimensions",
    "advancement": "triumph:patchouli-backend/beneath",
    "pages": [
        {
            "type": "text",
            "text": "At the bottom of the world lies an impenetrable floor of bedrock. It is said that if you go below it, you would find nothing but a hostile void. Below even that however, is the Beneath, and it is the least friendly place that you are likely to visit."
        },
        {
            "type": "text",
            "text": "The Beneath is extremely rich in resources, having almost every kind of ore, most of which are considerably more common and can be found anywhere in the dimension. It even contains an ore not found anywhere else: Carmot."
        },
        {
            "type": "spotlight",
            "item": "metallurgy:carmot_ore",
            "text": "Carmot is very rare, only found within massive stalactites made from deadrock. It is believed that carmot plays some role in forming the stalactites that surround it, but the process itself has never been recorded."
        },
        {
            "type": "text",
            "text": "The abundance of ores is not made easy for someone to exploit. The dimension is incredibly hostile, with all enemies that reside there being far stronger than you may be used to. This, however, may be the least of your concerns..."
        },
        {
            "type": "spotlight",
            "item": "minecraft:glowstone_dust",
            "text": "The darkness in the Beneath is much different from your run-of-the-mill lack of photons. It will actively attack you whilst you are in it, cutting deeper into you the longer you linger. Additionally, there are 2 special enemies that reside there, and both despise the light."
        },
        {
            "type": "entity",
            "entity": "beneath:shadow",
            "text": "These shadows will dodge any attack made against them by teleporting, and will attempt to drag you into the darkness."
        },
        {
            "type": "entity",
            "entity": "grue:entitygrue",
            "text": "Stay in the dark for too long, and you will be found by a Grue. You do not want to encounter a Grue."
        }
    ]
}