{
    "name": "Fuels",
    "icon": "projecte:item.pe_fuel",
    "category": "patchouli:alchemy",
    "advancement": "patchouli:alchemy/start",
    "priority": true,
    "pages": [
        {
            "type": "text",
            "text": "This book occasionally makes mention of 'fuel items'. This may seem rather self-explanatory at first, but experimentation has shown that it is not simply anything that can be burned as fuel. It seems to instead be a specific set of items. Listed here are all of the known ones.$(br)Something to note is that the block forms of these fuels also seem to work as fuel items."
        },
        {
            "type": "spotlight",
            "item": "minecraft:coal:1",
            "text": "Charcoal is an obvious one, though it also seems to be the weakest."
        },
        {
            "type": "spotlight",
            "item": "minecraft:coal",
            "text": "Coal seems to be stronger than charcoal, but is still at the lower end of the spectrum."
        },
        {
            "type": "spotlight",
            "item": "minecraft:redstone",
            "text": "Redstone is between coal and charcoal in its strength."
        },
        {
            "type": "spotlight",
            "item": "minecraft:gunpowder",
            "text": "Gunpowder is better than coal, but not by much."
        },
        {
            "type": "spotlight",
            "item": "minecraft:blaze_powder",
            "text": "Blaze powder is quite significantly more powerful than gunpowder."
        },
        {
            "type": "spotlight",
            "item": "minecraft:glowstone_dust",
            "text": "Glowstone dust appears to be the strongest of all known fuel types."
        },
        {
            "type": "spotlight",
            "advancement": "patchouli:alchemy/alchfuel",
            "item": "projecte:item.pe_fuel",
            "text": "$(7)Alchemicoal is incredibly energy dense, being far more powerful than even glowstone blocks. Additonally, it can be burned just like coal, but lasts four times longer."
        },
        {
            "type": "spotlight",
            "item": "projecte:item.pe_fuel:1",
            "advancement": "patchouli:alchemy/philo",
            "text": "$(philo)mobius fuel is equivalent to 4 alchemicoal, both in emc and in burn time."
        },
        {
            "type": "spotlight",
            "item": "projecte:item.pe_fuel:2",
            "advancement": "patchouli:alchemy/philo",
            "text": "$(philo)aeternalis fuel gives another quadrupling of power over mobius."
        },
        {
            "type": "spotlight",
            "item": "equivadditions:zeitheron_fuel",
            "advancement": "patchouli:alchemy/philo",
            "text": "$(philo)named after the stone required to create it, minumic fuel is the strongest of all fuel items, worth eight times more emc than even aeternalis fuel. as one might expect, it also burns for an incredibly long time."
        }
    ]
}