{
    "name": "Basics of Transmutation",
    "icon": "projecte:item.pe_covalence_dust",
    "category": "patchouli:alchemy",
    "priority": true,
    "advancement": "patchouli:alchemy/start",
    "pages": [
        {
            "type": "text",
            "text": "The field of Transmutation Alchemy is an interesting one. The ability to turn anything into anything else could be an extremely powerful tool. It is speculated that there is an artifact that must be obtained to allow for this, known as a $(philo)Philosopher's Stone$(), but no proof of the objects existence has ever been found. That doesn't mean no progress has been made however."
        },
        {
            "type": "spotlight",
            "item": "projecte:item.pe_covalence_dust",
            "text": "For instance: covalence dust. This strange powder can be created through the destruction of certain powerful magical objects from various schools of magic. This can be done by simply throwing them into fire.$(br2)This dust comes in 3 different types: low, medium, and high."
        },
        {
            "type": "text",
            "text": "The amount of discovered uses for this dust number few, but it seems willing to interact with almost any object. How it interacts seems to be incredibly inconsistent, ranging from simply making sparks to wiping both the object and the dust from existence.$(br2)Some objects seem to fuse with the dust, creating magical trinkets. Take a look at the other entries in this book for more information on those."
        },
        {
            "type": "text",
            "text": "What is more interesting however is the dusts reaction with glowstone. A mixture of the two creates a substance that is pitch black, but absorbs light. The color of the powder changes to pure white as it absorbs more light, until it absorbs to much and ceases to exist.$(br)$(4)We believe this property could be useful for something. Unfortunately, our research has hit a dead end, and the$() $(philo)Philosopher's Stone$() $(4)project has been shelved from lack of progress."
        },
        {
            "type": "text",
            "text": "$(o)Something else is here, written in faded ink. It seems to have been rather hastily scribbled, and is hard to make out...$(br2)$()$(7). ..... .... final entry .. ... ..... .... .. ........ anyone .... ever .......... this ...... .. defied ... High Council ... ......... work .. ... $(philo)Philosopher's Stone$() $(7)....... .. ....... .. took . ...., ......... ... forbidden ........ .... .. .... damned ..... ..... Ketu... .. ... .. .. something. .. ..... do not know .... ........ .. ..."
        },
        {
            "type": "text",
            "text": "$(7).. discovered ......... .. never .... . new ritual ....., ... .. dawn. ........... .. began looking ... new ....... .... ...., ... .... no ........ Then .. tried ..... other branches .. ....., ... .... ..... thaumaturgy ... ... ....... .......... salis ...... .... ... ...... ..... .. dawn ....... some .... ..... transmutation ......? .. absorbed ....... ....., ... ..... use the ..... .. ....... ... fuel ..... .. ... into ... Then, .. ....... .. try upgrading ............$()$(br2)$(o)The rest is completely illegible."
        },
        {
            "type": "text",
            "text": "$(philo)unfortunate, what happened to them. i do hope that you do not fail as badly as they did."
        }
    ]
}